In [1]:
import mysql.connector as conn
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
myconn = conn.connect(host='localhost',user = 'root',passwd = '2402')

In [3]:
cursor = myconn.cursor()

In [4]:
cursor.execute('USE sakila')

## Null Statement

In [8]:
query = """
SELECT *
FROM customer
WHERE first_name IS NULL
"""

data = pd.read_sql(query, myconn)

print(f'shape: {data.shape}')
data.head(2)

shape: (0, 9)

Empty DataFrame
Columns: [customer_id, store_id, first_name, last_name, email, address_id, active, create_date, last_update]
Index: []

In [9]:
data.to_csv('customer.csv', index=False)

## Not Null Statement

In [10]:
query = """
SELECT *
FROM customer
WHERE first_name IS NOT NULL
"""

data = pd.read_sql(query, myconn)

print(f"shape: {data.shape}")
data.head(2)

shape: (599, 9)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,VIJAY,DALVI,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2023-12-18 12:34:48
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

## UPDATE Values

In [11]:
query = """
UPDATE customer
SET first_name='VIJAY', last_name='DALVI'
WHERE customer_id=1
"""

cursor.execute(query)

In [12]:
query = """
SELECT *
FROM customer
WHERE customer_id=1
"""

data = pd.read_sql(query, myconn)
data.head()

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,VIJAY,DALVI,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2023-12-18 12:34:48

## CREATE TABLE

In [ ]:
query = """
CREATE TABLE city(ity_id INT,
    City INT,
    country_id VARCHAR(50),
    last_update DECIMAL(5, 2)
    
)
"""
cursor.execute(query)

In [ ]:
cursor.execute('drop table city')
# cursor.fetchall()

In [35]:
cursor.execute('show tables')
cursor.fetchall()

[('actor',),
 ('actor_info',),
 ('address',),
 ('category',),
 ('city',),
 ('country',),
 ('customer',),
 ('customer_list',),
 ('film',),
 ('film_actor',),
 ('film_category',),
 ('film_list',),
 ('film_text',),
 ('inventory',),
 ('language',),
 ('nicer_but_slower_film_list',),
 ('payment',),
 ('rental',),
 ('sales_by_film_category',),
 ('sales_by_store',),
 ('staff',),
 ('staff_list',),
 ('store',)]

In [22]:
query = """
SELECT *
FROM city
"""

data = pd.read_sql_query(query, myconn)

print(len(data))

600

## Insert Records

In [ ]:
query = """
INSERT INTO student_datawave(attendance_number, first_name, last_name, percentage, std, division)
VALUES(1, 'PRAVIN', 'DOLE', 98.5, 12, 'A')
"""

cursor.execute(query)

In [24]:
query = """
CREATE TABLE student_datawave(attendance_number INT,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    percentage DECIMAL(5, 2),
    std INT,
    division VARCHAR(20)
)
"""
cursor.execute(query)

In [ ]:
cursor.execute('drop table city')
# cursor.fetchall()

In [38]:
cursor.execute('show tables')
cursor.fetchall()

[('actor',),
 ('actor_info',),
 ('address',),
 ('category',),
 ('city',),
 ('country',),
 ('customer',),
 ('customer_list',),
 ('film',),
 ('film_actor',),
 ('film_category',),
 ('film_list',),
 ('film_text',),
 ('inventory',),
 ('language',),
 ('nicer_but_slower_film_list',),
 ('payment',),
 ('rental',),
 ('sales_by_film_category',),
 ('sales_by_store',),
 ('staff',),
 ('staff_list',),
 ('store',)]

## Drop Table

In [ ]:
query = """
DROP TABLE IF EXISTS staff
"""

cursor.execute(query)

In [39]:
cursor.execute('show tables')
cursor.fetchall()

[('actor',),
 ('actor_info',),
 ('address',),
 ('category',),
 ('city',),
 ('country',),
 ('customer',),
 ('customer_list',),
 ('film',),
 ('film_actor',),
 ('film_category',),
 ('film_list',),
 ('film_text',),
 ('inventory',),
 ('language',),
 ('nicer_but_slower_film_list',),
 ('payment',),
 ('rental',),
 ('sales_by_film_category',),
 ('sales_by_store',),
 ('staff',),
 ('staff_list',),
 ('store',)]

## LIMIT

In [41]:
cursor.execute('USE sakila')

query = """
SELECT *
FROM city
LIMIT 1
"""

data = pd.read_sql_query(query, myconn)

print(f"shape: {data.shape}")

data

shape: (1, 4)

   city_id                  city  country_id         last_update
0        1  A Coruña (La Coruña)          87 2006-02-15 04:45:25

In [43]:
cursor.execute('USE world')

query = """
SELECT MAX(Population)
FROM city
"""

data = pd.read_sql_query(query, myconn)
data

   MAX(Population)
0         10500000

## Aggregation

min

max 

avg

count

sum

In [44]:
cursor.execute('USE sakila')

query = """
SELECT *
FROM city
"""

data = pd.read_sql_query(query, myconn)

print(f"shape: {data.shape}")

data

shape: (600, 4)

     city_id                  city  country_id         last_update
0          1  A Coruña (La Coruña)          87 2006-02-15 04:45:25
1          2                  Abha          82 2006-02-15 04:45:25
2          3             Abu Dhabi         101 2006-02-15 04:45:25
3          4                 Acuña          60 2006-02-15 04:45:25
4          5                 Adana          97 2006-02-15 04:45:25
..       ...                   ...         ...                 ...
595      596                 Zaria          69 2006-02-15 04:45:25
596      597          Zeleznogorsk          80 2006-02-15 04:45:25
597      598           Zhezqazghan          51 2006-02-15 04:45:25
598      599              Zhoushan          23 2006-02-15 04:45:25
599      600            Ziguinchor          83 2006-02-15 04:45:25

[600 rows x 4 columns]

## MAX

In [5]:
cursor.execute('USE world')

query = """
SELECT MAX(Population)
FROM city
"""

data = pd.read_sql_query(query, myconn)
data

   MAX(Population)
0         10500000

## MIN

In [7]:
cursor.execute('USE world')

query = """
SELECT MIN(Population)
FROM city
"""

data = pd.read_sql_query(query, myconn)
data

   MIN(Population)
0               42

## COUNT

In [8]:
cursor.execute('USE world')

query = """
SELECT count(*)
FROM city
"""

data = pd.read_sql_query(query, myconn)
data

   count(*)
0      4079

In [9]:
cursor.execute('USE world')

query = """
SELECT count(*)
FROM city
WHERE Population < 1000000
"""

data = pd.read_sql_query(query, myconn)
data

   count(*)
0      3841

## AVG

In [10]:
cursor.execute('USE world')

query = """
SELECT AVG(Population)
FROM city
"""

data = pd.read_sql_query(query, myconn)
data

   AVG(Population)
0      350468.2236

## SUM

In [11]:
cursor.execute('USE world')

query = """
SELECT SUM(Population)
FROM city
"""

data = pd.read_sql_query(query, myconn)
data

   SUM(Population)
0     1.429560e+09

In [12]:
cursor.execute('USE world')

query = """
SELECT SUM(Population) AS population_sum
FROM city
"""

data = pd.read_sql_query(query, myconn)
data

   population_sum
0    1.429560e+09

In [13]:
cursor.execute('USE world')

query = """
SELECT 
SUM(Population) AS population_sum, 
MIN(Population) AS population_MIN, 
MAX(Population) AS population_max,
COUNT(Population) AS population_count,
AVG(Population) AS population_avg

FROM city
"""

data = pd.read_sql_query(query, myconn)
data

,population_sum,population_MIN,population_max,population_count,population_avg
0,1.429560e+09,42,10500000,4079,350468.2236

In [14]:
cursor.execute('USE world')

query = """
SELECT 
SUM(Population) AS population_sum, 
MIN(Population) AS population_MIN, 
MAX(Population) AS population_max,
COUNT(Population) AS population_count,
AVG(Population) AS population_avg

FROM city

WHERE Population > 1000000

"""

data = pd.read_sql_query(query, myconn)
data

,population_sum,population_MIN,population_max,population_count,population_avg
0,574137218.0,1002239,10500000,237,2.422520e+06

In [15]:
cursor.execute('USE world')

query = """
SELECT 
SUM(Population) AS population_sum, 
MIN(Population) AS population_MIN, 
MAX(Population) AS population_max,
COUNT(Population) AS population_count,
AVG(Population) AS population_avg

FROM city

WHERE Population BETWEEN 1000000 AND 2000000

"""

data = pd.read_sql_query(query, myconn)
data

,population_sum,population_MIN,population_max,population_count,population_avg
0,195416195.0,1000000,1987996,146,1338467.089

## LIKE Operator

In [ ]:
% : zero or one or multiple characters
    
_ : single

### Extract all the records with Name starts with 'M'

In [16]:
query = """
SELECT *
FROM city
WHERE Name LIKE 'M%'
"""

data = pd.read_sql_query(query, myconn)
print(f"shape: {data.shape}")
data.head(10)

shape: (301, 5)

    ID                 Name CountryCode      District  Population
0    4       Mazar-e-Sharif         AFG         Balkh      127800
1   22           Maastricht         NLD       Limburg      122087
2   46           Mostaganem         DZA    Mostaganem      115212
3   77        Mar del Plata         ARG  Buenos Aires      512880
4   80                Merlo         ARG  Buenos Aires      463846
5   83               Moreno         ARG  Buenos Aires      356993
6   87                Morón         ARG  Buenos Aires      349246
7   91  Malvinas Argentinas         ARG  Buenos Aires      290335
8  116              Mendoza         ARG       Mendoza      123027
9  131            Melbourne         AUS      Victoria     2865329

### Extract all the records where in name 2nd character is 'm'

In [17]:
cursor.execute('USE world')

query = """
SELECT *
FROM city
WHERE Name LIKE '_M%'
"""

data = pd.read_sql_query(query, myconn)

print(f"shape: {data.shape}")
data.head(10)

shape: (36, 5)

    ID        Name CountryCode          District  Population
0    5   Amsterdam         NLD     Noord-Holland      731200
1   21  Amersfoort         NLD           Utrecht      126270
2   27       Emmen         NLD           Drenthe      105853
3  299  Imperatriz         BRA          Maranhão      224564
4  301        Embu         BRA         São Paulo      222223
5  326   Americana         BRA         São Paulo      177409
6  599      Ambato         ECU        Tungurahua      169612
7  726      Umlazi         ZAF     KwaZulu-Natal      339233
8  809        Imus         PHL  Southern Tagalog      195482
9  971       Ambon         IDN           Molukit      249312

## In Operator

In [18]:
query = """
SELECT *
FROM city
WHERE Name IN ('Delhi', 'Pune', 'Mumbai')
"""

data = pd.read_sql_query(query, myconn)

print(f"shape: {data.shape}")
data.head(10)

shape: (2, 5)

     ID   Name CountryCode     District  Population
0  1025  Delhi         IND        Delhi     7206704
1  1034   Pune         IND  Maharashtra     1566651